tap "buo/cask-upgrade", trusted: true
tap "glepnir/iswitch", trusted: true
brew "bash"
brew "bat"
brew "bear"
brew "bottom"
brew "cmake"
brew "container"
brew "difftastic"
brew "dust"
brew "fd"
brew "fish"
brew "fzf"
brew "go"
brew "neovim"
brew "node"
brew "pi-coding-agent"
brew "pnpm"
brew "ripgrep"
brew "rustup"
brew "shellcheck"
brew "sing-box"
brew "tlrc"
brew "tmux"
brew "tokei"
brew "tree"
brew "tree-sitter-cli"
brew "typst"
brew "uv"
brew "wget"
brew "yazi"
brew "zoxide"
brew "glepnir/iswitch/iswitch"
cask "alacritty"
cask "chatgpt"
cask "firefox"
cask "font-iosevka-term-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "hammerspoon"
cask "iina"
cask "karabiner-elements"
cask "keka"
cask "keycastr"
cask "mac-mouse-fix"
cask "oracle-jdk@21"
cask "qbittorrent"
cask "qq"
cask "raycast"
cask "skim"
cask "squirrel-app"
cask "steam"
cask "tencent-lemon"
cask "ungoogled-chromium"
cask "visual-studio-code"
cask "wechat"
cask "xld"
vscode "ms-vscode-remote.remote-ssh"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
uv "ruff"
uv "ty"
